{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "SchemaStore.nvim": {
      "src": "https://github.com/b0o/SchemaStore.nvim"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "ccc.nvim": {
      "src": "https://github.com/uga-rosa/ccc.nvim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "cscope_maps.nvim": {
      "src": "https://github.com/dhananjaylatkar/cscope_maps.nvim"
    },
    "diffs.nvim": {
      "src": "https://github.com/barrettruth/diffs.nvim"
    },
    "eregex.vim": {
      "src": "https://github.com/othree/eregex.vim"
    },
    "git-messenger.vim": {
      "src": "https://github.com/rockyzhang24/git-messenger.vim",
      "version": "'dev'"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "inc-rename.nvim": {
      "src": "https://github.com/smjonas/inc-rename.nvim"
    },
    "iswap.nvim": {
      "src": "https://github.com/mizlan/iswap.nvim"
    },
    "linediff.vim": {
      "src": "https://github.com/AndrewRadev/linediff.vim"
    },
    "neogen": {
      "src": "https://github.com/danymat/neogen"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/kyazdani42/nvim-web-devicons"
    },
    "quick-scope": {
      "src": "https://github.com/unblevable/quick-scope"
    },
    "quickfix-reflector.vim": {
      "src": "https://github.com/stefandtw/quickfix-reflector.vim"
    },
    "tabular": {
      "src": "https://github.com/godlygeek/tabular"
    },
    "tagbar": {
      "src": "https://github.com/preservim/tagbar"
    },
    "treesj": {
      "src": "https://github.com/Wansmer/treesj"
    },
    "undotree": {
      "src": "https://github.com/mbbill/undotree"
    },
    "vim-ReplaceWithRegister": {
      "src": "https://github.com/inkarkat/vim-ReplaceWithRegister"
    },
    "vim-after-object": {
      "src": "https://github.com/junegunn/vim-after-object"
    },
    "vim-apathy": {
      "src": "https://github.com/tpope/vim-apathy"
    },
    "vim-asterisk": {
      "src": "https://github.com/haya14busa/vim-asterisk"
    },
    "vim-dispatch": {
      "src": "https://github.com/tpope/vim-dispatch"
    },
    "vim-eunuch": {
      "src": "https://github.com/tpope/vim-eunuch"
    },
    "vim-exchange": {
      "src": "https://github.com/tommcdo/vim-exchange"
    },
    "vim-flog": {
      "src": "https://github.com/rbong/vim-flog"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-gtfo": {
      "src": "https://github.com/justinmk/vim-gtfo"
    },
    "vim-ingo-library": {
      "src": "https://github.com/inkarkat/vim-ingo-library"
    },
    "vim-mark": {
      "src": "https://github.com/inkarkat/vim-mark"
    },
    "vim-obsession": {
      "src": "https://github.com/tpope/vim-obsession"
    },
    "vim-projectionist": {
      "src": "https://github.com/tpope/vim-projectionist"
    },
    "vim-repeat": {
      "src": "https://github.com/tpope/vim-repeat"
    },
    "vim-rhubarb": {
      "src": "https://github.com/tpope/vim-rhubarb"
    },
    "vim-sleuth": {
      "src": "https://github.com/tpope/vim-sleuth"
    },
    "vim-sneak": {
      "src": "https://github.com/justinmk/vim-sneak"
    },
    "vim-startuptime": {
      "src": "https://github.com/dstein64/vim-startuptime"
    },
    "vim-surround": {
      "src": "https://github.com/tpope/vim-surround"
    }
  }
}
